frontend/controllers/SiteController.php

SELECT `nama`, `id` FROM `provinsi`
INSERT INTO `kontributor_pangan` (`nik`, `npwp`, `nama_lengkap`, `no_handphone`, `email`, `provinsi`, `kota`, `kecamatan`, `kelurahan`, `rt`, `rw`, `kode_pos`, `lat`, `lng`) VALUES ('11-11-11-11-11-11-1111', '11.111.111.1-111.111', 'Muhammad Azhar Rasyad', '+62111111111111', 'm1@gmail.com', '31', '3171', '3171010', '3171010001', 11, 11, 11111, '-6.4571822999999995', '106.83273659999999')
---
    public function actionKontributorPangan()
    {
        $model = new \common\models\KontributorPangan();

        $provinsis = \common\models\Provinsi::find()->select(['nama', 'id'])
          ->indexBy('id')
          ->column();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `kota` WHERE `provinsi_id`='11' ORDER BY `id`
---
    public function actionKab($id)
    {
        $kotas = \common\models\Kota::find()
                ->where(['provinsi_id' => $id])
                ->orderBy('id ASC')
                ->all();

SELECT * FROM `kecamatan` WHERE `kota_id`='1111' ORDER BY `id`
---
    public function actionKec($id)
    {
        $kecamatans = \common\models\Kecamatan::find()
                ->where(['kota_id' => $id])
                ->orderBy('id ASC')
                ->all();

SELECT * FROM `kelurahan` WHERE `kecamatan_id`='3171010' ORDER BY `id`
---
    public function actionDesa($id)
    {
        $kelurahans = \common\models\Kelurahan::find()
                ->where(['kecamatan_id' => $id])
                ->orderBy('id ASC')
                ->all();