frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->hint_password = $this->password;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;
---
INSERT INTO `user` (`username`, `email`, `hint_password`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('mazharrasyad', 'mazharrasyad@gmail.com', 'rahasia', '$2y$13$zUIXosbwEKjlKvgyRlB5xuS.UpitXXrrWRBih1DvyN.gShcOudP6W', 'ph-5Rv0TIJUu6T9szmiLV6SDCfANjNnM', 10, 1533051534, 1533051534)